DataProcessors/ПроверкаИПодборПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаИПодборПродукцииИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СоответствиеНоменклатурыСырьяГИСМТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыСырьяГИСМТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сырье</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСырьяГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтатусыПроверкиИПодбораИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПроверкиИПодбораИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеПроверкиИПодбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроверкиИПодбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиИПодбораИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТребуемоеДействиеЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТребуемоеДействиеДокументЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Ключ таблицы штрихкодов упаковок (если их несколько)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ПроверкаИПодборПродукцииИС/Forms/СопоставлениеСырья/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПроверяемыйДокумент = Параметры.ПроверяемыйДокумент;
	Сценарий = Параметры.Сценарий;
	
	Если ПроверяемыйДокумент = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Форма сопоставления сырья не предназначена для внеконтекстного использования.'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ТаблицаПродукции = СверкаКодовМаркировкиИСМП.ТаблицаМаркируемойПродукцииДокумента(ПроверяемыйДокумент);
	ТаблицаПродукции.Свернуть("Номенклатура, Характеристика, ВидПродукции");
	
	НомерСтроки = 1;
	Для Каждого СтрокаДокумента Из ТаблицаПродукции Цикл
		
		Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоСырьеГИСМТ(СтрокаДокумента.ВидПродукции) Тогда
			
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			НоваяСтрока.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Товары.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не найдено номенклатуры, подконтрольной видам продукции ""Сырье"".'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	// РаботаСКлючомВидовПродукции - Товары
	СобытияФормИС.КлючВидовПродукцииИнициализация(ЭтотОбъект, "Товары");
	СобытияФормИС.КлючВидовПродукцииЗаполнитьДанные(ЭтотОбъект, Товары);
	// Конец РаботаСКлючомВидовПродукции
	
	ВосстановитьСохраненныеРезультаты(ПроверяемыйДокумент);
	
	РегистрыСведений.СоответствиеНоменклатурыСырьяГИСМТ.ЗаполнитьСопоставленноеСырьеВДокументе(
		Товары,
		Истина);
	
	ХарактеристикиИспользуются = ОбщегоНазначенияИС.ХарактеристикиИспользуются();
	Если ХарактеристикиИспользуются Тогда
		ИнтеграцияИСПереопределяемый.ЗаполнитьСлужебныеРеквизитыВКоллекции(Неопределено, Товары);
	КонецЕсли;
	Элементы.ТоварыХарактеристика.Видимость = ХарактеристикиИспользуются;
	
	СобытияФормИСМП.УстановитьСвязиПараметровВыбораВидПродукции(ЭтотОбъект, "ТоварыСырье");
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПриАктивизацииЯчейки(Элемент)
	
	Если Элемент.ТекущийЭлемент = Элементы.ТоварыСырье Тогда
		
		Элементы.ТоварыСырье.СписокВыбора.ЗагрузитьЗначения(Элементы.Товары.ТекущиеДанные.НоменклатураДляВыбора.ВыгрузитьЗначения());
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСырьеПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСырьеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	СобытияФормИСМПКлиент.ПриНачалеВыбораСырья(Элемент, ТекущиеДанные, СтандартнаяОбработка, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьИЗакрытьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	СобытияФормИСПереопределяемый.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
		ЭтотОбъект,
		"ТоварыХарактеристика",
		"Товары.ХарактеристикиИспользуются");
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСырье.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Сырье");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.СопоставлениеТекст");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",            ЦветаСтиля.ЦветТекстаПроблемаГосИС);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",                 Новый ПолеКомпоновкиДанных("Товары.СопоставлениеТекст"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьСохраненныеРезультаты(ДокументДляОтбора)
	
	СтруктураОтбора = Новый Структура("Документ, Сценарий", ДокументДляОтбора, 0);
	СтруктураРесурсовПроверки = РегистрыСведений.СтатусыПроверкиИПодбораИС.Получить(СтруктураОтбора);
	
	Если ТипЗнч(СтруктураРесурсовПроверки.ДанныеПроверкиИПодбора) <> Тип("ХранилищеЗначения") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПроверкиИПодбора = СтруктураРесурсовПроверки.ДанныеПроверкиИПодбора.Получить();
	
	Если ТипЗнч(ДанныеПроверкиИПодбора) <> Тип("Структура")
		Или Не ДанныеПроверкиИПодбора.Свойство("СопоставленноеСырье") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура");
	ПараметрыОтбора.Вставить("Характеристика");
	
	Для Каждого СтрокаТаблицы Из ДанныеПроверкиИПодбора.СопоставленноеСырье Цикл
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаТаблицы);
		НайденныеСтроки = Товары.НайтиСтроки(ПараметрыОтбора);
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Сырье = СтрокаТаблицы.Сырье;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьФорму()
	
	Отказ = Ложь;
	СохранитьРезультаты(Отказ);
	
	Если Не Отказ Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СохранитьИЗакрытьФорму();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультаты(Отказ)
	
	Если Не ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СырьеПоДокументу = СопоставленноеСырье();
	
	Для Каждого СтрокаТаблицы Из Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Сырье) Тогда
			ЗаполнитьЗначенияСвойств(СырьеПоДокументу.Добавить(), СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	ИнтеграцияИСМП.ЗаполнитьСлужебныеРеквизитыСырье(СырьеПоДокументу);
	
	НачатьТранзакцию();
	
	Попытка
		
		Если СырьеПоДокументу.Количество() > 0 Тогда
			
			Результат = Новый Структура;
			Результат.Вставить("СопоставленноеСырье", СырьеПоДокументу);
	
			СохраняемыеДанныеСопоставления = Новый ХранилищеЗначения(Результат);
			РегистрыСведений.СтатусыПроверкиИПодбораИС.ОтразитьЗавершение(
				ПроверяемыйДокумент,
				СохраняемыеДанныеСопоставления,
				Сценарий);
			РегистрыСведений.СоответствиеНоменклатурыСырьяГИСМТ.ЗаписатьСоответствие(Неопределено, СырьеПоДокументу);
		Иначе
			РегистрыСведений.СтатусыПроверкиИПодбораИС.ОчиститьРезультаты(ПроверяемыйДокумент);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Отказ = Истина;
		
		ЗаголовокСообщения    = НСтр("ru = 'Произошла ошибка при сохранении результатов сопоставления:'");
		Информация            = ИнформацияОбОшибке();
		СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
		
		ТекстыСообщенияЖР = Новый Массив;
		ТекстыСообщенияЖР.Добавить(ЗаголовокСообщения);
		ТекстыСообщенияЖР.Добавить(Символы.ПС);
		ТекстыСообщенияЖР.Добавить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(Информация));
		
		Если СообщенияПользователю.Количество() Тогда
			Для Каждого Сообщение Из СообщенияПользователю Цикл
				ТекстыСообщенияЖР.Добавить(Символы.ПС);
				ТекстыСообщенияЖР.Добавить(Сообщение.Текст);
			КонецЦикла;
		КонецЕсли;
		
		ОбщегоНазначенияИСВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
			СтрСоединить(ТекстыСообщенияЖР),,
			Метаданные.Обработки.ПроверкаИПодборПродукцииИС);
		
		ТекстыСообщения = Новый Массив;
		ТекстыСообщения.Добавить(ЗаголовокСообщения);
		ТекстыСообщения.Добавить(Символы.ПС);
		ТекстыСообщения.Добавить(ОбработкаОшибок.КраткоеПредставлениеОшибки(Информация));
		
		Если СообщенияПользователю.Количество() Тогда
			Для Каждого Сообщение Из СообщенияПользователю Цикл
				ТекстыСообщения.Добавить(Символы.ПС);
				ТекстыСообщения.Добавить(Сообщение.Текст);
			КонецЦикла;
		Иначе
			ТекстыСообщения.Добавить(Символы.ПС);
			ТекстыСообщения.Добавить(НСтр("ru = 'Подробности см. в журнале регистрации.'"));
		КонецЕсли;
		
		ВызватьИсключение СтрСоединить(ТекстыСообщения);
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция СопоставленноеСырье()
	
	СопоставленноеСырье = Новый ТаблицаЗначений;
	СопоставленноеСырье.Колонки.Добавить("Номенклатура",   Метаданные.ОпределяемыеТипы.Номенклатура.Тип);
	СопоставленноеСырье.Колонки.Добавить("Характеристика", Метаданные.ОпределяемыеТипы.ХарактеристикаНоменклатуры.Тип);
	СопоставленноеСырье.Колонки.Добавить("Сырье",          Новый ОписаниеТипов("СправочникСсылка.КлассификаторСырьяГИСМТ"));
	СопоставленноеСырье.Колонки.Добавить("Идентификатор",  Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	
	Возврат СопоставленноеСырье;
	
КонецФункции

#КонецОбласти
